Revit 2024 API
VertexBuffer Class
 A buffer that stores vertex data for rendering.
Namespace: Autodesk.Revit.DB.DirectContext3D
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public class VertexBuffer : IDisposable
Visual Basic
Public Class VertexBuffer _
	Implements IDisposable
Visual C++
public ref class VertexBuffer : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.DirectContext3D.VertexBuffer
See Also
VertexBuffer Members
Autodesk.Revit.DB.DirectContext3D Namespace